{
  "__type__": "cc.TextAsset",
  "_name": "RELEASE_ENGINEERING",
  "_objFlags": 0,
  "_native": "",
  "text": "# Cocos2d-x Release Engineering\n\n\n## Tagging\n\nNew releases must be tagged in github. The tag name must follow these rules:\n\n    cocos2d-x-Major.Minor[.Status]\n\nor\n\n    cocos2d-x-Major.Minor.Revision[.Status]\n\nExample of valid names:\n\n* cocos2d-x-3.0rc0\n* cocos2d-x-3.0\n* cocos2d-x-2.1.1\n* cocos2d-x-2.1.1rc0\n\nSee \"Naming Conventions\" below\n\n## Branching\n\nEach Major version will have 2 branches, `master` and `develop`.\nFor cocos2d-x v3, the branches names will be `v3-master` and `v3-develop`, for v4 the branches names will be `v4-master` and `v4-develop`, and so on.\n\n* `master` is the stable branch.\n* `develop` is the unstable branch. All new features, bug fixes, etc, are applied first to `develop`.\n\nOnce a new version is released (either Major, Minor or Revision), then `develop` branch must be merged into `master` branch. To be more specific, `master` only contains _stable_ releases. _Alpha_, _Beta_, and _RC_ versions MUST NOT be merged into `master`.\n\n\n## Announcing\n\nOnly stable releases must be announced on:\n\n* [Blog](http://www.cocos2d-x.org/news)\n\nAll kind of releases (alpha,beta,rc, final) must be announced on:\n* [Twitter](https://twitter.com/cocos2dx)\n* [Forum](http://discuss.cocos2d-x.org/)\n\n\n## Download package\n\nA download package must be available for each released version.\nThe package shall include the source code of cocos2d-x, and the needed scripts to download and install the 3rd party binaries.\n\n\n## Release Notes and Changelog\n\n**BEFORE** releasing a new version (either stable or unstable), the following documents must be updated:\n\n* [CHANGELOG](https://github.com/cocos2d/cocos2d-x/blob/v3/CHANGELOG)\n* [Release Notes](https://github.com/cocos2d/cocos2d-x/blob/v3/docs/RELEASE_NOTES.md)\n\n## Documentation\n\n**BEFORE** releasing a new Minor or Major stable release, the following tasks MUST be done:\n\n- All documentation MUST be updated to the new version. This includes:\n    - API Reference\n    - Programmers Guide\n\n## Backward compatibility\n\n- Minor versions MUST be backward compatible with previous minor versions. eg: v3.2 must be backward compatible with v3.1 and v3.0.\n- Major versions SHOULD be backward compatible with previous major versions. Breaking backward compatibility in Major versions is acceptable only if it is extremely well justified\n\n## Deprecated APIs\n\n- Only Major versions (eg: 4.0, 5.0) can introduce deprecated APIs. Deprecated APIs cannot be introduced in Point releases (eg: 3.5, 4.2).\n- Only Major versions can remove deprecated APIs. They cannot be removed in Point versions.\n- A deprecated API must live at least for the whole cycle of a Major version. Eg: if an API was deprecated in 4.0, it can be removed in 5.0, but not before. It can be removed in 6.0 or future Major releases, but it cannot be removed in Point releases, like 5.1.\n\n\n## Performance tests\n\n- Performance tests MUST be run before releasing a Release Candidate\n- If performance is worse than previous stable version, then the Release Candidate MUST NOT be released (See Naming Conventions below)\n- Results of the performance tests must be documented in this [spreadsheet](https://docs.google.com/spreadsheet/ccc?key=0AvvkdgVbWvpZdHFudzdDT3NuYTRNTHlZZzRGZWYzMmc#gid=8)\n\n\n## Samples and tests\n\n**BEFORE** releasing a new Minor or Major stable release, the following tasks MUST be done:\n\n- All the samples and tests must be updated to use the new version. This includes:\n    - The samples in [cocos2d-x-samples](https://github.com/cocos2d/cocos2d-x-samples) repository\n    - The demo games [EarthWarrior3D](https://github.com/chukong/EarthWarrior3D) and [FantasyWarrior3D](https://github.com/chukong/FantasyWarrior3D)\n    - All the tests bundled in cocos2d-x\n    - All the templates bundled in cocos2d-x\n\n## Naming conventions\n\n### Alpha\n\nThe product is unstable. It could have memory leaks, or crashes, or the API is unstable. The product contains little QA.\nAlthough the product is not ready for production, the product should be testable.\nAlpha versions might have Core functionality that has just been refactored, meaning that Core functionality might be unstable, but should work Ok.\n\nAs an example, for cocos2d-x, an _Alpha_ version means:\n\n* Basic functionality works Ok (not great, but OK), like Sprites, Scenes, actions, etc.\n_* But it might have memory leaks, or crashes, or the recently added features might be unfinished. The documentation might not be updated.\n* As an example, the Renderer refactoring must be done in \"alpha\" versions (but not Beta versions).\n\nAlpha versions are NOT feature freeze. New features might be added in future alpha and beta versions.\n\n### Beta\n\nThe product is more stable than _Alpha_. The product might crash, but not frequently. No major changes were made in core components.\nSmaller features could be refactored in _Beta_ versions, but the core functionality is stable.\nThe product has more QA.\nThe only difference between _Alpha_ and _Beta_, is that _Beta_ is more stable than _Alpha_. And that in _Beta_ versions no new major features will be added.\n\nAs an example, for cocos2d-x it means:\n\n* All the Core features (Sprites, Menu, Labels, Director, Transitions) are stable. Bug fixes could have been added into the Core functionality, but no major refactoring were done in the Core.\n* But perhaps new features like the new Particle Engine could be unfinished, or the Cocos Studio reader might crash.\n* Some cocos2d-x users might want to use a beta version for real games.\n\nBeta versions are NOT feature freeze. __Small__ new features might be added in future _Beta_ versions. New __BIG__ features that might affect the Core functionality must only be added in _Alpha_ versions, and not in _Beta_ versions.\n\n\n### Release Candidate\nRelease candidate means that, unless major bugs are found, the product is ready for release.\nThe difference between _Release Candidate__ and _Final_ is that RC has less testing than the final version.\n\nMany cocos2d-x users might want to try and use the RC releases for production.\n\nRC versions ARE feature freeze. No new features, no matter how small they are, MUST be added in RC versions, because as the name implies, it is a _Release Candidate_.\n\n\n### Final\n\nIt is the new stable version.\n\n## Number conventions\n\nmajor.minor [revision | status]\n\n### Major\nThe major number is increased when there are significant jumps in functionality such as changing the framework which could cause incompatibility with interfacing systems\n\n### Minor\nThe minor number is incremented when only minor features or significant fixes have been added.\n\n### Revision\nThe revision number is incremented when minor bugs are fixed.\n\n### Status\nThe status could be: alphaN, betaN or rcN.\n\n'N' is a number, and the first MUST always be 0.\n\n### Examples\n\nv2.0-alpha0:\n  - New major version of cocos2d-x.\n  - Unstable\n\nv2.1.3:\n   - Stable version of cocos2d-x. It is the same as v2.1 plus some bug fixes.\n\nv2.2-beta0:\n   - Similar to v2.1.3, but some new features were added, but are not stable yet.\n\nv2.2:\n   - Similar to v2.1.3, but some small features were added. The new features are stable.\n"
}